app/controllers/api/v1/clients_controller.rb

  def create
    client = Client.new(client_params)
    client.save ? (render json: client, status: :created) : (error_response(client.errors.messages))
---
INSERT INTO "clients" ("email", "full_name", "id_card", "phone", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["email", "lucas@gmail.com"], ["full_name", "lucas albo"], ["id_card", 3230], ["phone", 32323], ["address", "139"], ["created_at", 2020-05-04 20:59:28 UTC], ["updated_at", 2020-05-04 20:59:28 UTC]]