app/controllers/api/v1/orders_controller.rb

  def create
    @order = @current_user.orders.build
    @order.build_orders_with_product_ids_and_quantities(params[:order][:product_ids_and_quantities])
    @order.save ? (render json: 'Your purchase was successful!', status: 200) : (render json: @order.errors.messages, status: 200)
---
SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "orders" ("client_id", "created_at", "updated_at", "total") VALUES (?, ?, ?, ?)  [["client_id", 1], ["created_at", 2020-05-05 18:56:51 UTC], ["updated_at", 2020-05-05 18:56:51 UTC], ["total", 0.64646e5]]
INSERT INTO "purchases" ("order_id", "product_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?)  [["order_id", 1], ["product_id", 1], ["created_at", 2020-05-05 18:51:25 UTC], ["updated_at", 2020-05-05 18:51:25 UTC], ["quantity", 2]]

  def update
    @order = @current_user.orders.where(id: params[:id]).first
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    order = @current_user.orders.where(id: params[:id]).first
    head 200 if order.destroy
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]

  def find_order
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? ORDER BY "orders"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]