app/controllers/api/v1/products_controller.rb

INSERT INTO "products" ("title", "description", "available_stock", "price", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "zapatos"], ["description", "zapatos"], ["available_stock", 100], ["price", 1.0], ["visible", true], ["created_at", 2020-05-04 21:15:09 UTC], ["updated_at", 2020-05-04 21:15:09 UTC]]
---
  def create
    product = Product.new(product_params)
    render json: product, status: :created if product.save

UPDATE "products" SET "title" = ?, "visible" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "heladera"], ["visible", false], ["updated_at", 2020-05-06 03:11:15 UTC], ["id", 1]]
---
  def update
    render json: @product, status: :ok if @product.update_attributes(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? ORDER BY "products"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_product
    @product = Product.find(params[:id])